'use strict';

/* Основы работы с пользовательскими функциями в JavaScript */
/* Функция создается с помощью команды function. Далее через пробел следует имя функции, круглые скобки, а затем фигурные скобки, в которых пишется какой-то код:
function func() {
	// какой-то код
} */

/* Задача 1⋕js.Pm.UF.CC.1
Сделайте функцию, выводящую на экран ваше имя. */
/* function myName(){
	console.log('Kirill')
}
myName(); */ // kirill

/* Задача 2⋕js.Pm.UF.CC.2
Сделайте функцию, выводящую на экран сумму чисел от 1 до 100. */
/* function numbers(){
	let result = 0;
	for (let i = 0; i <= 100; i++){
		result += i;
		console.log(result);
	}
}
numbers(); */ // 5050
